// Задача 19 Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

/*

Console.Clear();

Console.Write("Input integer five-digit number: ");
string Num = Console.ReadLine();

void Function(string Num)
{
  if (Num[0] == Num[4] && Num[1] == Num[3])   Console.WriteLine($"{Num} -> да");
  else Console.WriteLine($"{Num} -> нет");
}

if (Num.Length == 5) Function(Num);
else Console.WriteLine($"It is not a five-digit number");

*/

// Задача 21 Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.

//A (3,6,8); B (2,1,-7), -> 15.84
//A (7,-5, 0); B (1,-1,9) -> 11.53

//Задача 23 Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

//3 -> 1, 8, 27
//5 -> 1, 8, 27, 64, 125